1G_Air_Vehicle_Hotel/GdsQueueList_1G.txt

	<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<ns2:GdsQueueListReq ProviderCode="1G" TraceId="de08a979-6dd5-4b04-b5d1-7b0986fcb157" TargetBranch="P6666666" xmlns:ns9="http://www.travelport.com/schema/cruise_v50_0" xmlns:ns8="http://www.travelport.com/schema/rail_v50_0" xmlns:ns7="http://www.travelport.com/schema/universal_v50_0" xmlns:ns6="http://www.travelport.com/schema/passive_v50_0" xmlns:ns5="http://www.travelport.com/schema/air_v50_0" xmlns:ns4="http://www.travelport.com/schema/hotel_v50_0" xmlns:ns3="http://www.travelport.com/schema/vehicle_v50_0" xmlns:ns2="http://www.travelport.com/schema/gdsQueue_v50_0" xmlns="http://www.travelport.com/schema/common_v50_0">
			<BillingPointOfSaleInfo OriginApplication="ABCD"/>
			<ns2:GdsQueueSelector Queue="21"/>
		</ns2:GdsQueueListReq>
	</soap:Body>
</soap:Envelope>

<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
	<SOAP:Body>
		<gdsQueue:GdsQueueListRsp xmlns:gdsQueue="http://www.travelport.com/schema/gdsQueue_v50_0" xmlns:common="http://www.travelport.com/schema/common_v50_0" TraceId="de08a979-6dd5-4b04-b5d1-7b0986fcb157" TransactionId="AF330DEF0A0759BB82AB919FD7667699" ResponseTime="341">
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="123456" DepartureDate="20230410" QueueDate="06MAR" QueueTime="16:27:00" Name="1ADAMS/WENQIMS" UniversalRecordLocatorCode="1ITV0F" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="123456" DepartureDate="20230410" QueueDate="06MAR" QueueTime="16:27:00" Name="1ROBERTS/HUIJUNMS"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="234567" DepartureDate="" QueueDate="06MAR" QueueTime="16:31:00" Name="1CALT/YUXINMSLT/YUXINMS" UniversalRecordLocatorCode="VHV7EM" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="345678" DepartureDate="" QueueDate="06MAR" QueueTime="16:32:00" Name="1WANCHESTER/ZIXIMISS" UniversalRecordLocatorCode="56B5ZS" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="345678" DepartureDate="" QueueDate="06MAR" QueueTime="16:32:00" Name="1ROBERTS/YONGMS"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="345678" DepartureDate="" QueueDate="06MAR" QueueTime="16:32:00" Name="1BARETTANRY/XIUQIONGMS"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="345678" DepartureDate="" QueueDate="06MAR" QueueTime="16:32:00" Name="1WANCHESTER/BINGHUAMR"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="456789" DepartureDate="" QueueDate="06MAR" QueueTime="16:33:00" Name="1RAMINGTON/SHAOJIEMR" UniversalRecordLocatorCode="08YGO1" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="567890" DepartureDate="" QueueDate="06MAR" QueueTime="16:33:00" Name="1ROBERTS/CHUNFANGMS" UniversalRecordLocatorCode="25CWHO" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="678901" DepartureDate="20230311" QueueDate="06MAR" QueueTime="16:33:00" Name="1DOE/SIQIMS" UniversalRecordLocatorCode="S47R3L" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="789012" DepartureDate="" QueueDate="06MAR" QueueTime="16:33:00" Name="1BRAWNING/MINGQIMR" UniversalRecordLocatorCode="24DGQZ" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="890123" DepartureDate="" QueueDate="06MAR" QueueTime="16:33:00" Name="1ARMALATE/WALEEDMR" UniversalRecordLocatorCode="3VCMKF" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="901234" DepartureDate="" QueueDate="06MAR" QueueTime="16:33:00" Name="1KAMBER/LIANGUOMR" UniversalRecordLocatorCode="WAV7DJ" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="901234" DepartureDate="" QueueDate="06MAR" QueueTime="16:33:00" Name="1ROBERTS/GUIFENMS"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="012345" DepartureDate="" QueueDate="06MAR" QueueTime="16:33:00" Name="1RAGER/TINGMS" UniversalRecordLocatorCode="01RUGERO" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="098765" DepartureDate="" QueueDate="06MAR" QueueTime="16:33:00" Name="1SMATH/RENYUANMR" UniversalRecordLocatorCode="AW7V1F" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="987654" DepartureDate="" QueueDate="06MAR" QueueTime="16:33:00" Name="1WASSON/HANANMR" UniversalRecordLocatorCode="EY602W" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="876543" DepartureDate="20230313" QueueDate="06MAR" QueueTime="16:33:00" Name="1ROBERTS/CHUNFENGMS" UniversalRecordLocatorCode="26NR4G" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="876543" DepartureDate="20230313" QueueDate="06MAR" QueueTime="16:33:00" Name="1RAMINGTON/TAOMR"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="765432" DepartureDate="" QueueDate="06MAR" QueueTime="16:33:00" Name="1BARATTACKLER/QINMS" UniversalRecordLocatorCode="LYVVXD" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="654321" DepartureDate="" QueueDate="06MAR" QueueTime="16:34:00" Name="1KACH/TANANATMR" UniversalRecordLocatorCode="1OZC82" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="654321" DepartureDate="" QueueDate="06MAR" QueueTime="16:34:00" Name="1SPRANGFIELD/PIMPAORNMS"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="543210" DepartureDate="" QueueDate="06MAR" QueueTime="16:34:00" Name="1DAASY/QIJINMS" UniversalRecordLocatorCode="9QJ8XW" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="432109" DepartureDate="20230106" QueueDate="06MAR" QueueTime="16:34:00" Name="1CRASSMAN/YUNYIMS" UniversalRecordLocatorCode="R2LFC9" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="321098" DepartureDate="" QueueDate="06MAR" QueueTime="16:34:00" Name="1VARTEX/KAREEMMR" UniversalRecordLocatorCode="00OWVF" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="210987" DepartureDate="" QueueDate="06MAR" QueueTime="16:34:00" Name="1DOE/YUNFANMR" UniversalRecordLocatorCode="DTFLEV" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="210987" DepartureDate="" QueueDate="06MAR" QueueTime="16:34:00" Name="1DOE/CHENGZHIMISS"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="210987" DepartureDate="" QueueDate="06MAR" QueueTime="16:34:00" Name="1SAG/YUANYUANMS"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="109876" DepartureDate="" QueueDate="06MAR" QueueTime="16:34:00" Name="1SAAR/CHUNMS" UniversalRecordLocatorCode="9HVXHL" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="109876" DepartureDate="" QueueDate="06MAR" QueueTime="16:34:00" Name="1BARATTA/JINGJINGMS"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="ABCDEF" DepartureDate="20230413" QueueDate="06MAR" QueueTime="16:34:00" Name="1RAMINGTONNG/YONGKUNGMR" UniversalRecordLocatorCode="569V5J" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="GHIJKL" DepartureDate="20230208" QueueDate="06MAR" QueueTime="16:34:00" Name="1BARRATT/YUMS" UniversalRecordLocatorCode="MNARP5" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="MNOPQR" DepartureDate="20230327" QueueDate="06MAR" QueueTime="16:34:00" Name="1RAMINGTON/XIAOHANMS" UniversalRecordLocatorCode="2084IH" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="MNOPQR" DepartureDate="20230327" QueueDate="06MAR" QueueTime="16:34:00" Name="1DOE/BOWENMR"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="STUVWX" DepartureDate="" QueueDate="06MAR" QueueTime="16:34:00" Name="1TAARUS/ZHIJIAMR" UniversalRecordLocatorCode="2ID5RV" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="YZABCD" DepartureDate="" QueueDate="06MAR" QueueTime="16:34:00" Name="1TAARUS/SHUANGMR" UniversalRecordLocatorCode="M1S1EV" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="YZABCD" DepartureDate="" QueueDate="06MAR" QueueTime="16:34:00" Name="1DOE/FENGCHUNMS"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="EFGHIJ" DepartureDate="" QueueDate="06MAR" QueueTime="16:35:00" Name="1MARLAN/QUNYONGMR" UniversalRecordLocatorCode="2KISXS" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="KLMNOP" DepartureDate="" QueueDate="06MAR" QueueTime="16:35:00" Name="1MASSBERG/POLINAMS" UniversalRecordLocatorCode="V78G9A" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
			<gdsQueue:QueueElement ProviderCode="1G" ProviderLocatorCode="QRSTUV" DepartureDate="" QueueDate="06MAR" QueueTime="16:35:00" Name="1ROBERTS/CHUNFANGMS" UniversalRecordLocatorCode="25D5SE" CreatedByAgentCode="ABCD3711328844-A36C95D1" ModifiedByAgentCode="ABCD3711328844-A36C95D1"/>
		</gdsQueue:GdsQueueListRsp>
	</SOAP:Body>
</SOAP:Envelope>
